In [1]:
import pandas as pd
import sqlite3

In [2]:
import sqlite3
conn = sqlite3.connect('my_database.db')
c = conn.cursor()

In [3]:
 c.execute('''DROP TABLE table_2021''')

In [4]:
c.execute('''CREATE TABLE table_2021 (FullPhoneNumber text,state text,cityname text,persongender  text,personexactage text,personmaritalstatus text,traveler text,ZipCode text,investment text,estimatedincomecode text,timezone text,DONOTCALL text,"PresenceOfCreditCard" text,CreditRating  text )''')

In [5]:
c.execute('''INSERT INTO table_2021(FullPhoneNumber ,state,cityname ,persongender ,personexactage,personmaritalstatus ,traveler ,ZipCode ,investment ,estimatedincomecode ,timezone,DONOTCALL ,"PresenceOfCreditCard" ,CreditRating ) VALUES(NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL) ''')

In [6]:
c.execute('''SELECT * FROM table_2021''')

In [10]:
sql_File=pd.read_sql('''SELECT * FROM table_2021''',conn)
sql_File

,FullPhoneNumber,state,cityname,persongender,personexactage,personmaritalstatus,traveler,ZipCode,investment,estimatedincomecode,timezone,DONOTCALL,PresenceOfCreditCard,CreditRating
0,None,None,None,None,None,None,None,None,None,None,None,None,None,None

In [11]:
import os
list_of_dir = os.listdir(r'Z:\AIDAILER\Tony DB 2021')
list_of_iter = iter(list_of_dir)

In [16]:

for i in range(len(list_of_dir)):
    df = pd.read_csv(os.path.join("Z:\AIDAILER\Tony DB 2021" ,str(next(list_of_iter))))
    df=df[['FullPhoneNumber',
             'state',
             'estimatedincomecode',
             'personexactage',
             'CreditRating',
             'cityname',
             'ZipCode',
             'National DNC']]
    
    df.rename(columns = {'National DNC':'DONOTCALL'}, inplace = True)
    
    df['FullPhoneNumber']=df['FullPhoneNumber'].astype(str)
    df=df[df['FullPhoneNumber'] != 'nan']
    
    df['personexactage']=df['personexactage'].astype(str)
    df['ZipCode']=df['ZipCode'].astype(str)
    
    df.to_sql('table_2021', conn, if_exists='append', index = False)
    print(i+1, df.shape, list_of_dir[i], 'Appended to Database')

StopIteration:

In [3]:
pd.read_sql('''SELECT * FROM table_2021
             LIMIT 10''',conn)

,FullPhoneNumber,state,cityname,persongender,personexactage,personmaritalstatus,traveler,ZipCode,investment,estimatedincomecode,timezone,DONOTCALL,PresenceOfCreditCard,CreditRating
0,None,None,None,None,None,None,None,None,None,None,None,None,None,None
1,9072272643,AK,Hope,None,79,None,None,99605,None,M,None,N,None,B
2,9073609503,AK,Anchorage,None,77,None,None,99501,None,S,None,Y,None,A
3,9072742175,AK,Anchorage,None,61,None,None,99501,None,R,None,N,None,B
4,9072743803,AK,Anchorage,None,80,None,None,99501,None,H,None,N,None,D
5,9072768688,AK,Anchorage,None,75,None,None,99501,None,R,None,N,None,B
6,9079526719,AK,Anchorage,None,47,None,None,99501,None,O,None,Y,None,C
7,9072585104,AK,Anchorage,None,101,None,None,99501,None,N,None,Y,None,B
8,9072585104,AK,Anchorage,None,101,None,None,99501,None,N,None,Y,None,B
9,9073981394,AK,Anchorage,None,53,None,None,99501,None,M,None,Y,None,F